<a href="https://colab.research.google.com/github/Olgerd96/NeuralUniversity/blob/main/19.1_%D0%A0andas1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas часть 1. Домашнее Задание. Ultra-Light

*2 балла за каждую задачу*

*1 бонусный балл, если все задачи покрыты комментариями, которые описывают тактику решение задачи*

### Задание 1
*(2 балла)*

Воссоздайте таблицу в виде Pandas DataFrame.

![image.png]()

**Решение:**

In [2]:
import pandas as pd
#columns = [x for x in range(7)]
columns = list(range(0,7)) 
my_df = pd.DataFrame([[x*y for x in range(7)] for y in range(4)], columns=columns)  #колонки можно было не задавать: автонумерация столбцов подходит

print("1. Создана таблица типа: " + str(type(my_df)))
my_df

1. Создана таблица типа: <class 'pandas.core.frame.DataFrame'>

   0  1  2  3   4   5   6
0  0  0  0  0   0   0   0
1  0  1  2  3   4   5   6
2  0  2  4  6   8  10  12
3  0  3  6  9  12  15  18

### Задание 2
*(2 балла)*

Сложите все значения в таблице по столбцам без использования циклов и условий.

**Решение:**

In [4]:
all_sum = my_df.sum(axis = 0)
print("2. Сумма по столбцам: \n" + str(all_sum))

2. Сумма по столбцам:
0     0
1     6
2    12
3    18
4    24
5    30
6    36
dtype: int64

### Задание 3
*(2 балла)*

При помощи метода Pandas выведите размерность матрицы. Убедитесь в корректности результата.

**Решение:**

In [7]:
print(f"3. Размерность my_df:\t {my_df.shape}.")

3. Размерность my_df:	 (4, 7).

### Задание 4
*(2 балла)*

При помощи метода Pandas выведите 2 отдельных Series, содержащие данные из второго и пятого столбца. При помощи команды type проверьте тип получившихся объектов.

**Решение:**

In [37]:
ser1 = my_df[1]
ser2 = my_df[4]

print(f"4.1 Серия из второго (индекс = 1) столбца :\n{ser1}")
print(f"\n4.2 Серия из пятого (индекс = 4) столбца :\n{ser2}")
print(f"\n4.3 Тип данных обоих серияй: \t{type(ser1)}")
print(f"Дополнительная проверка. Тип данных из функции Series: \t{type(pd.Series(range(5)))}")

4.1 Серия из второго (индекс = 1) столбца :
0    0
1    1
2    2
3    3
Name: 1, dtype: int64

4.2 Серия из пятого (индекс = 4) столбца :
0     0
1     4
2     8
3    12
Name: 4, dtype: int64

4.3 Тип данных обоих серияй: 	<class 'pandas.core.series.Series'>
Дополнительная проверка. Тип данных из функции Series: 	<class 'pandas.core.series.Series'>

### Задание 5
*(2 балла)*

Добавьте в таблицу столбец **7**, содержащий значения **0, 7, 14, 21.**

**Решение:**

In [64]:
#my_df[my_df.shape[1]] = pd.Series([0, 7, 14, 12]) - сначала хотел всегда добавлять новый столбец, но прочитал задание и там явно указано "7"
my_df[7] = pd.Series([0, 7, 14, 12])
print("5. Датафрейм с добавленным столбцом 7:")
my_df

5. Датафрейм с добавленным столбцом 7:

   0  1  2  3   4   5   6   7
0  0  0  0  0   0   0   0   0
1  0  1  2  3   4   5   6   7
2  0  2  4  6   8  10  12  14
3  0  3  6  9  12  15  18  12